var arr0=["1. 函数的基本概念","2. 极限","3. 无穷小与无穷大","4. 连续与间断","5. 导数","6. 中值定理","7. 导数的应用","8. 不定积分","9. 定积分","10. 定积分的应用","11. 向量代数与空间解析几何","12. 多元函数微分","13. 重积分","14. 曲线积分","15. 曲面积分","16. 场论","17. 多元积分的应用","18. 常数项级数","19. 幂级数","20. 傅里叶级数","21. 微分方程"];
var arr1=["(1) 函数","(2) 反函数","(3) 复合函数","(4) 自然定义域","(5) 绝对值函数","(6) 符号函数","(7) 取整函数", "(8) 狄利克雷函数","(9) 有界性","(10) 周期性","(11) 单调性","(12) 奇偶性","(13) 基本初等函数"];
var arr2=["(1) 邻域","(2) 数列的极限","(3) 函数的极限(一)","(4) 函数的极限(二)","(5) 保号性","(6) 夹逼定理","(7) 单调有界定理","(8) 极限运算法则","(9) 两个重要极限","(10) 补充一个重要极限"];
var arr3=["(1) 无穷的定义","(2) 无穷小的性质","(3) 无穷小的比较","(4) 等价无穷小替换定理","(5) 三角类等价无穷小","(6) 反三角类等价无穷小","(7) 指数类等价无穷小","(8) 对数类等价无穷小","(9) 幂与根式类等价无穷小"];
var arr4=["(1) 某点处连续","(2) 区间上连续","(3) 间断点","(4) 可去间断点与跳跃间断点","(5) 无穷间断点与震荡间断点","(6) 第一类间断点与第二类间断点","(7) 闭区间上连续函数的性质"];
var arr5=["(1) 导数的定义","(2) 左, 右导数","(3) 微分","(4) 常用导数","(5) 导数与微分运算法则","(6) 复合函数求导法则","(7) 反函数求导法则","(8) 隐函数求导法则","(9) 参数方程求导法则","(10) 高阶导数","(11) 高阶导数莱布尼茨公式"];
var arr6=["(1) 罗尔定理","(2) 拉格朗日中值定理","(3) 柯西中值定理","(4) 洛必达法则","(5) 泰勒公式","(6) 常用带佩亚诺余项的麦克劳林公式"];
var arr7=["(1) 单调性的判定","(2) 凹凸性的定义","(3) 凹凸性的判定","(4) 曲线的拐点","(5) 极值的定义","(6) 判定极值的第一充分条件","(7) 判定极值的第二充分条件","(8) 曲率"];
var arr8=["(1) 原函数","(2) 不定积分","(3) 不定积分的性质","(4) 常用积分表","(5) 第一类换元积分法","(6) 第二类换元积分法","(7) 分部积分法","(8) 有理函数与真假分式","(9) 部分分式和","(10) 根式代换","(11) 补充积分表"];
var arr9=["(1) 定积分的定义","(2) 牛顿-莱布尼茨公式","(3) 求和极限化为定积分","(4) 定积分表示原函数","(5) 定积分的换元法","(6) 定积分的分部积分法","(7) 无穷限的反常积分","(8) 无界函数的反常积分"]
var arr10=["(1) 平面图形面积","(2) 旋转体体积","(3) 平面曲线弧长","(4) 质量与质心"];
var arr11=["(1) 向量的基本概念","(2) 加减与数乘","(3) 数量积","(4) 向量积","(5) 混合积","(6) 平面一般式方程","(7) 平面点法式方程","(8) 平面截距式方程","(9) 平面三点式方程","(10) 直线一般式方程","(11) 直线对称式方程","(12) 直线参数方程","(13) 位置关系","(14) 夹角","(15) 点到平面距离","(16) 旋转曲面"];
var arr12=["(1) 二元函数概念","(2) 二元函数极限","(3) 二重极限不存在的判定","(4) 二元函数连续性","(5) 偏导数","(6) 二阶偏导数","(7) 全增量","(8) 全微分","(9) 可微分的必要条件和充分条件","(10) 多元复合函数求导法则","(11) 隐函数求导公式 1","(12) 隐函数求导公式 2","(13) 隐函数求导公式 3","(14) 隐函数求导公式 4","(15) 一元向量值函数","(16) 空间曲线的切线与法平面 1","(17) 空间曲线的切线与法平面 2"
,"(18) 曲面的切平面与法线","(19) 方向导数","(20) 梯度","(21) 多元函数极值与极值点的定义","(22) 驻点","(23) 二元函数取极值的充分条件","(24) 条件极值 1","(25) 条件极值 2","(26) 条件极值 3"];
var arr13=["(1) 二重积分的定义与性质","(2) 二重积分的计算","(3) 利用极坐标计算二重积分","(4) 三重积分的定义","(5) 先二后一","(6) 先一后二","(7) 利用柱坐标计算三重积分","(8) 利用球坐标计算三重积分","(9) 利用奇偶性计算重积分","(10) 利用变量对称性计算重积分"];
var arr14=["(1) 第一类曲线积分","(2) 第二类曲线积分","(3) 格林公式 1","(4) 格林公式 2","(5) 路径无关","(6) 斯托克斯公式"];
var arr15=["(1) 第一类曲面积分","(2) 第二类曲面积分","(3) 高斯公式"];
var arr16=["(1) 梯度","(2) 散度","(3) 旋度"];
var arr17=["(1) 平面图形的各种量","(2) 空间体的各种量","(3) 曲线的各种量","(4) 曲面的各种量","(5) 变力作功"];
var arr18=["(1) 级数的基本概念","(2) 收敛级数的基本性质","(3) p 级数","(4) 比较审敛法","(5) 极限形式的比较审敛法","(6) 极限审敛法","(7) 比值审敛法","(8) 根值审敛法","(9) 莱布尼茨定理","(10) 绝对收敛与条件收敛"];
var arr19=["(1) 函数项级数","(2) 幂级数","(3) 收敛半径","(4) 幂级数的四则运算","(5) 和函数的性质","(6) 函数展开成幂级数"];
var arr20=["(1) 傅里叶级数与收敛定理","(2) 余弦级数","(3) 正弦级数","(4) 任意周期的傅里叶展开"];
var arr21=["(1) 微分方程的基本概念","(2) 微分方程的解","(3) 可分离变量的微分方程","(4) 齐次方程","(5) 一阶线性微分方程",
"(6) 伯努利方程","(7) 可降阶的高阶微分方程 1","(8) 可降阶的高阶微分方程 2","(9) 可降阶的高阶微分方程 3","(10) 线性相关与线性无关","(11) 二阶齐次线性微分方程","(12) 二阶非齐次线性微分方程","(13) 叠加原理","(14) 二阶常系数齐次线性微分方程","(15) n 阶常系数齐次线性微分方程","(16) 二阶常系数非齐次线性微分方程","(17) 欧拉方程"];
var arr=[arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,arr19,arr20,arr21];
var n0=arr0.length;